# UIThemeManager Class

---
Manager object for the UITheme class.
SystemObject Autodesk.Revit.UIUIThemeManager
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class UIThemeManager

    Public NotInheritable Class UIThemeManager

    public ref class UIThemeManager abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type UIThemeManager = class end
The UIThemeManager type exposes the following members.
| Name| Description
---|---|---
| CurrentCanvasTheme|  current canvas theme.
| CurrentTheme|  The current overall theme which impacts the Revit frame and canvas.
| FollowSystemColorTheme|  Indicate if the overall theme follows operating system color theme.
Top
| Name| Description
---|---|---
| GetThemeName|  Gets the theme name for the given theme type.
Top
#### Reference
Autodesk.Revit.UI Namespace